INSERT INTO Student VALUES 
	(DEFAULT, 'Сиянгулова Ульяна Афанасиевна', 2009, 301, 1),
	(DEFAULT, 'Покровский Аркадий Валериевич', 2009, 301, 1),
	(DEFAULT, 'Климов Артур Семенович', 2009, 301, 1),
	(DEFAULT, 'Приходько Юрий Ефремович', 2010, 201, 3),
	(DEFAULT, 'Ветрова Евгения Тимуровна', 2010, 202, 3),
	(DEFAULT, 'Дарюшин Георгий Денисович', 2010, 202, 3),
	(DEFAULT, 'Артемьев Трофим Геннадиевич', 2011, 104, 1),
	(DEFAULT, 'Быстров Тимофей Евгениевич', 2011, 111, 3),
	(DEFAULT, 'Астафьев Юрий Брониславович', 2011, 121, 2),
	(DEFAULT, 'Яковлева Валентина Серафимовна', 2011, 103, 2);

INSERT INTO Teacher VALUES 
	(DEFAULT, 'Богатырёв Евгений Михайлович'),
	(DEFAULT, 'Меликова Маргарита Трофимовна'),
	(DEFAULT, 'Шумилова Полина Всеволодовна'),
	(DEFAULT, 'Шорин Вячеслав Кириллович'),
	(DEFAULT, 'Курчатова Светлана Игоревна'),
	(DEFAULT, 'Молодцов Константин Даниилович'),
	(DEFAULT, 'Фонвизин Филипп Леонович'),
	(DEFAULT, 'Якшина Оксана Всеволодовна'),
	(DEFAULT, 'Каштанова Валентина Ефимовна'),
	(DEFAULT, 'Сыров Руслан Гаврилевич');

INSERT INTO Course VALUES 
	(DEFAULT, 'Мат. анализ', 2, 2009),
	(DEFAULT, 'Прикладная алгебра', 2, 2009),
	(DEFAULT, 'Базы данных', 1, 2011),
	(DEFAULT, 'Экономика', 0, 2009),
	(DEFAULT, 'Практикум на ЭВМ', 3, 2010);
	
--select * from study_class;

INSERT INTO Auditorium VALUES 
	(103, 50),
	(211, 50),
	(124, 30),
	(140, 120),
	(120, 50),
	(113, 50),
	(233, 30),
	(203, 30),
	(403, 30),
	(104, 50);

INSERT INTO Study_Class VALUES
	(DEFAULT, 1, 1, 103, '11-05-03 08:45:00'),
	(DEFAULT, 3, 2, 124, '11-05-03 10:30:00'),
	(DEFAULT, 2, 3, 203, '11-05-03 10:30:00'),
	(DEFAULT, 4, 7, 140, '11-05-04 10:30:00'),
	(DEFAULT, 2, 3, 120, '11-05-07 12:50:00'),
	(DEFAULT, 1, 10, 403, '11-05-08 14:35:00'),
	(DEFAULT, 3, 5, 233, '11-05-08 16:20:00'),
	(DEFAULT, 5, 6, 104, '11-05-09 8:45:00'),
	(DEFAULT, 4, 8, 120, '11-05-07 17:55:00'),
	(DEFAULT, 2, 9, 211, '11-05-08 16:20:00');
	
INSERT INTO CourseStudent_Info VALUES
	(DEFAULT, 1, 10, 2),
	(DEFAULT, 1, 9, 2),
	(DEFAULT, 1, 8, 6),
	(DEFAULT, 4, 1, 2),
	(DEFAULT, 2, 2, 4),
	(DEFAULT, 3, 4, 2),
	(DEFAULT, 5, 6, 8),
	(DEFAULT, 5, 5, 4),
	(DEFAULT, 4, 8, 2),
	(DEFAULT, 3, 3, 6);

INSERT INTO CourseTeacher_Info VALUES
	(DEFAULT, 1, 1, 4),
	(DEFAULT, 4, 7, 2),
	(DEFAULT, 5, 6, 6),
	(DEFAULT, 4, 8, 2),
	(DEFAULT, 2, 9, 8),
	(DEFAULT, 2, 3, 2),
	(DEFAULT, 1, 10, 2),
	(DEFAULT, 5, 3, 8),
	(DEFAULT, 3, 5, 8),
	(DEFAULT, 1, 3, 8);
	
	
	


